; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared4 - mode
	spectrograph5 - mode
	image1 - mode
	thermograph0 - mode
	image3 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star9 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 image3)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Star13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Star14 infrared4)
	(have_image Star15 infrared2)
	(have_image Star15 thermograph0)
	(have_image Phenomenon16 infrared4)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite1 groundstation4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
4. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 8
5. (turn_to satellite1 phenomenon16 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 8
6. (take_image satellite1 phenomenon16 instrument2 infrared4)
   added: (have_image phenomenon16 infrared4)
   goals met: 1 of 8
7. (turn_to satellite1 star14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star14)
   goals met: 1 of 8
8. (take_image satellite1 star14 instrument2 infrared4)
   added: (have_image star14 infrared4)
   goals met: 2 of 8
9. (turn_to satellite0 groundstation7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 8
10. (turn_to satellite0 star9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star9)
   goals met: 2 of 8
11. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 2 of 8
12. (turn_to satellite0 groundstation7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 8
13. (turn_to satellite0 phenomenon16 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 8
14. (take_image satellite0 phenomenon16 instrument0 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 3 of 8
15. (turn_to satellite0 groundstation7 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation7)
   goals met: 4 of 8
16. (turn_to satellite0 star13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star13)
   goals met: 3 of 8
17. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 4 of 8
18. (turn_to satellite0 groundstation7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation7)
   goals met: 5 of 8
19. (turn_to satellite0 star14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
20. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 5 of 8
21. (turn_to satellite0 groundstation7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation7)
   goals met: 6 of 8
22. (turn_to satellite0 star15 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star15)
   goals met: 5 of 8
23. (take_image satellite0 star15 instrument0 infrared2)
   added: (have_image star15 infrared2)
   goals met: 6 of 8
24. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 7 of 8
25. (turn_to satellite0 groundstation7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation7)
   goals met: 8 of 8
